# üìä LEVEL 2 ‚Äî Sales Analysis

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('mysql+pymysql://root:password@127.0.0.1/crm_sales')

### Q1. Display all products with their series and sales price.

In [11]:
query = f"""select * from products;"""
table_data = pd.read_sql(query, engine)
display(table_data)

          product series  sales_price
0       GTX Basic    GTX          550
1         GTX Pro    GTX         4821
2      MG Special     MG           55
3     MG Advanced     MG         3393
4    GTX Plus Pro    GTX         5482
5  GTX Plus Basic    GTX         1096
6         GTK 500    GTK        26768

### Q2. Find the average sales price of products in each series.

In [15]:
query = f"""select series,avg(sales_price) from products group by series;"""
table_data = pd.read_sql(query, engine)
display(table_data)

  series  avg(sales_price)
0    GTX           2987.25
1     MG           1724.00
2    GTK          26768.00

### Q3. Join sales_pipeline with products and show each opportunity‚Äôs product name, deal stage, and sales price.

In [ ]:
query = f"""select sp.opportunity_id,p.product,sp.deal_stage,p.sales_price from sales_pipeline as sp join products as p on sp.product = p.product;"""
table_data = pd.read_sql(query, engine)
display(table_data)

     opportunity_id         product deal_stage  sales_price
0          1C1I7A6R  GTX Plus Basic        Won         1096
1          EC4QE1BX      MG Special        Won           55
2          MV1LWRNH       GTX Basic        Won          550
3          PE84CX4O       GTX Basic        Won          550
4          ZNBS69V1      MG Special        Won           55
...             ...             ...        ...          ...
5559       1YBATFAY       GTX Basic        Won          550
5560       2EBLR9N8       GTX Basic        Won          550
5561       VDGA4KXA  GTX Plus Basic        Won         1096
5562       YJTQSZ9D  GTX Plus Basic        Won         1096
5563       RB8GDYFY      MG Special        Won           55

[5564 rows x 4 columns]

### Q4. Show all deals handled by Darcel Schlecht along with their status (Won/Lost) and close value.

In [26]:
query = f"""select sales_agent,deal_stage,close_value from sales_pipeline where sales_agent = 'Darcel Schlecht';"""
table_data = pd.read_sql(query, engine)
display(table_data)

         sales_agent deal_stage  close_value
0    Darcel Schlecht        Won         4514
1    Darcel Schlecht        Won           50
2    Darcel Schlecht        Won          561
3    Darcel Schlecht       Lost            0
4    Darcel Schlecht        Won         1170
..               ...        ...          ...
548  Darcel Schlecht        Won         4888
549  Darcel Schlecht       Lost            0
550  Darcel Schlecht        Won         4755
551  Darcel Schlecht        Won         5052
552  Darcel Schlecht       Lost            0

[553 rows x 3 columns]

### Q5. Find the total number of deals per deal_stage (Won, Lost, Engaging).

In [31]:
query = f"""select deal_stage,count(deal_stage) from sales_pipeline group by deal_stage;"""
table_data = pd.read_sql(query, engine)
display(table_data)

  deal_stage  count(deal_stage)
0        Won               4238
1       Lost               2473

### Q6. List all Won deals with close_value greater than 1000.

In [39]:
query = f"""select * from sales_pipeline where deal_stage = 'Won' and close_value > 1000 ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

,opportunity_id,sales_agent,product,account,deal_stage,engage_date,close_date,close_value
0,1C1I7A6R,Moses Frase,GTX Plus Basic,Cancity,Won,2016-10-20,2017-03-01,1054
1,Z063OYW0,Darcel Schlecht,GTXPro,Isdom,Won,2016-10-25,2017-03-11,4514
2,OLK9LKZB,Niesha Huffines,GTX Plus Basic,Zumgoity,Won,2016-11-01,2017-03-03,1026
3,S8DX3XOU,James Ascencio,GTX Plus Pro,Sunnamplex,Won,2016-11-04,2017-03-10,5169
4,ENB2XD8G,Maureen Marcano,GTX Plus Pro,Sonron,Won,2016-11-04,2017-03-06,4631
...,...,...,...,...,...,...,...,...
2375,B50N6RL3,Gladys Colclough,MG Advanced,Genco Pura Olive Oil Company,Won,2017-12-21,2017-12-30,3494
2376,MSN4ZNU6,Violet Mclelland,MG Advanced,Betasoloin,Won,2017-12-22,2017-12-28,3673
2377,VDGA4KXA,Violet Mclelland,GTX Plus Basic,Bluth Company,Won,2017-12-24,2017-12-30,1093
2378,6WCNNK5J,Maureen Marcano,GTXPro,Hottechi,Won,2017-12-26,2017-12-29,4433
2379,YJTQSZ9D,Gladys Colclough,GTX Plus Basic,Inity,Won,2017-12-27,2017-12-30,1052

### Q7. Find top 5 products that generated the highest total deal value.

In [45]:
query = f"""select product,deal_stage,close_value from sales_pipeline order by close_value desc limit 5 ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

   product deal_stage  close_value
0  GTK 500        Won        30288
1  GTK 500        Won        29617
2  GTK 500        Won        29220
3  GTK 500        Won        29166
4  GTK 500        Won        27971

### Q8. Show the total revenue from all ‚ÄúWon‚Äù deals.

In [57]:
query = f"""select sum(ac.revenue) as Total_revenue,sp.deal_stage from accounts as ac
            join sales_pipeline as sp on ac.account = sp.account
            where sp.deal_stage = 'Won';"""
table_data = pd.read_sql(query, engine)
display(table_data)

   Total_revenue deal_stage
0    10576285.17        Won

### Q9. Find the total number of Won deals per sales agent.

In [61]:
query = f"""select sales_agent,count(deal_stage) as Total_Won,deal_stage from sales_pipeline where deal_stage = 'Won' group by sales_agent ;"""
table_data = pd.read_sql(query, engine)
display(table_data)

           sales_agent  Total_Won deal_stage
0          Moses Frase        129        Won
1      Darcel Schlecht        349        Won
2            Zane Levy        161        Won
3        Anna Snelling        208        Won
4       Vicki Laflamme        221        Won
5       Markita Hansen        130        Won
6      Niesha Huffines        105        Won
7       James Ascencio        135        Won
8      Maureen Marcano        149        Won
9        Hayden Neloms        107        Won
10     Rosalina Dieter         72        Won
11   Versie Hillebrand        176        Won
12        Elease Gluck         80        Won
13    Violet Mclelland        122        Won
14       Kami Bicknell        174        Won
15     Kary Hendrixson        209        Won
16        Reed Clapper        155        Won
17      Wilburn Farren         55        Won
18       Garret Kinder         75        Won
19   Marty Freudenburg        122        Won
20     Lajuana Vencill        127        Won
21           Boris Faz        101        Won
22       Donn Cantrell        158        Won
23       Corliss Cosme        150        Won
24    Gladys Colclough        135        Won
25        Cassey Cress        163        Won
26      Cecily Lampkin        107        Won
27  Rosie Papadopoulos         78        Won
28  Jonathan Berthelot        171        Won
29     Daniell Hammack        114        Won

### Q10. Display all deals handled by sales agents in the East region (join sales_pipeline and sales_teams).

In [74]:
query = f"""select sp.product,sp.account,sp.sales_agent,st.regional_office,sp.deal_stage from sales_teams as st 
            join sales_pipeline as sp 
            on st.sales_agent = sp.sales_agent
            where regional_office = 'East';"""
table_data = pd.read_sql(query, engine)
display(table_data)

,product,account,sales_agent,regional_office,deal_stage
0,GTXPro,Xx-zobam,Daniell Hammack,East,Lost
1,GTX Plus Basic,Vehement Capital Partners,Violet Mclelland,East,Won
2,GTX Plus Pro,Xx-zobam,Violet Mclelland,East,Lost
3,MG Advanced,Zotware,Rosie Papadopoulos,East,Lost
4,GTX Basic,Acme Corporation,Reed Clapper,East,Won
...,...,...,...,...,...
1853,MG Advanced,Xx-zobam,Donn Cantrell,East,Lost
1854,GTXPro,Vehement Capital Partners,Rosie Papadopoulos,East,Won
1855,MG Advanced,Betasoloin,Violet Mclelland,East,Won
1856,GTX Basic,Ganjaflex,Cassey Cress,East,Won
1857,GTX Plus Basic,Bluth Company,Violet Mclelland,East,Won